Name: Ankita Kalyankar
Roll no: 13225
Class: TE (B1)
Title: Creation of Dataset using Microsoft Excel.3. Identification and Handling of Outliers

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
df=pd.read_csv("MYdataset.csv")

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79 entries, 0 to 78
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   MathScore          79 non-null     int64
 1   Reading_score      79 non-null     int64
 2   Writing_score	     79 non-null     int64
 3   Performance_score  79 non-null     int64
 4   Club_joindate      79 non-null     int64
dtypes: int64(5)
memory usage: 3.2 KB

In [6]:
df=pd.read_csv("MYdataset.csv")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79 entries, 0 to 78
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   MathScore          74 non-null     float64
 1   Reading_score      76 non-null     float64
 2   Writing_score	     73 non-null     float64
 3   Performance_score  75 non-null     float64
 4   Club_joindate      75 non-null     float64
dtypes: float64(5)
memory usage: 3.2 KB

In [8]:
df.fillna(39)

,MathScore,Reading_score,Writing_score\t,Performance_score,Club_joindate
0,47.0,95.0,49.0,19.0,2024.0
1,59.0,73.0,70.0,43.0,2024.0
2,60.0,97.0,65.0,68.0,2023.0
3,35.0,111.0,40.0,81.0,2022.0
4,60.0,108.0,72.0,80.0,2022.0
...,...,...,...,...,...
74,30.0,93.0,71.0,56.0,2022.0
75,60.0,104.0,66.0,61.0,2024.0
76,52.0,98.0,35.0,63.0,2020.0
77,59.0,110.0,87.0,46.0,2023.0
78,49.0,108.0,60.0,90.0,2021.0

In [9]:
df.min

<bound method DataFrame.min of     MathScore  Reading_score  Writing_score\t  Performance_score  \
0        47.0           95.0             49.0               19.0
1        59.0           73.0             70.0               43.0
2        60.0           97.0             65.0               68.0
3        35.0          111.0             40.0               81.0
4        60.0          108.0             72.0               80.0
..        ...            ...              ...                ...
74       30.0           93.0             71.0               56.0
75       60.0          104.0             66.0               61.0
76       52.0           98.0             35.0               63.0
77       59.0          110.0             87.0               46.0
78       49.0          108.0             60.0               90.0

    Club_joindate
0          2024.0
1          2024.0
2          2023.0
3          2022.0
4          2022.0
..            ...
74         2022.0
75         2024.0
76         2020.0
77         2023.0
78         2021.0

[79 rows x 5 columns]>

In [11]:
df.head(15)

,MathScore,Reading_score,Writing_score\t,Performance_score,Club_joindate
0,47.0,95.0,49.0,19.0,2024.0
1,59.0,73.0,70.0,43.0,2024.0
2,60.0,97.0,65.0,68.0,2023.0
3,35.0,111.0,40.0,81.0,2022.0
4,60.0,108.0,72.0,80.0,2022.0
5,20.0,77.0,64.0,15.0,2021.0
6,44.0,82.0,95.0,55.0,2022.0
7,44.0,119.0,72.0,37.0,2021.0
8,47.0,81.0,83.0,14.0,2023.0
9,24.0,111.0,57.0,21.0,2022.0
10,NaN,90.0,43.0,59.0,2023.0
11,NaN,88.0,43.0,28.0,2024.0
12,NaN,108.0,69.0,61.0,2024.0
13,NaN,68.0,39.0,14.0,2022.0
14,NaN,93.0,35.0,15.0,2020.0

In [12]:
df.describe()

,MathScore,Reading_score,Writing_score\t,Performance_score,Club_joindate
count,74.000000,76.000000,73.000000,75.000000,75.000000
mean,43.148649,93.815789,69.712329,49.666667,2022.160000
std,12.300665,15.132050,18.832949,24.063729,1.356067
min,20.000000,67.000000,35.000000,11.000000,2020.000000
25%,33.250000,81.750000,54.000000,28.000000,2021.000000
50%,44.000000,94.000000,71.000000,50.000000,2022.000000
75%,54.000000,105.000000,84.000000,68.000000,2023.000000
max,60.000000,120.000000,100.000000,90.000000,2024.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79 entries, 0 to 78
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   MathScore          74 non-null     float64
 1   Reading_score      76 non-null     float64
 2   Writing_score	     73 non-null     float64
 3   Performance_score  75 non-null     float64
 4   Club_joindate      75 non-null     float64
dtypes: float64(5)
memory usage: 3.2 KB

In [14]:
df

,MathScore,Reading_score,Writing_score\t,Performance_score,Club_joindate
0,47.0,95.0,49.0,19.0,2024.0
1,59.0,73.0,70.0,43.0,2024.0
2,60.0,97.0,65.0,68.0,2023.0
3,35.0,111.0,40.0,81.0,2022.0
4,60.0,108.0,72.0,80.0,2022.0
...,...,...,...,...,...
74,30.0,93.0,71.0,56.0,2022.0
75,60.0,104.0,66.0,61.0,2024.0
76,52.0,98.0,35.0,63.0,2020.0
77,59.0,110.0,87.0,46.0,2023.0
78,49.0,108.0,60.0,90.0,2021.0

In [15]:
df.MathScore.fillna(89)

0     47.0
1     59.0
2     60.0
3     35.0
4     60.0
      ...
74    30.0
75    60.0
76    52.0
77    59.0
78    49.0
Name: MathScore, Length: 79, dtype: float64

In [16]:
df.columns.values

array(['MathScore', 'Reading_score', 'Writing_score\t',
       'Performance_score', 'Club_joindate'], dtype=object)

In [17]:
df.iloc[20]

MathScore              55.0
Reading_score          72.0
Writing_score\t        51.0
Performance_score      54.0
Club_joindate        2022.0
Name: 20, dtype: float64

In [19]:
df.iloc[:,2:4]

    Writing_score\t  Performance_score
0              49.0               19.0
1              70.0               43.0
2              65.0               68.0
3              40.0               81.0
4              72.0               80.0
..              ...                ...
74             71.0               56.0
75             66.0               61.0
76             35.0               63.0
77             87.0               46.0
78             60.0               90.0

[79 rows x 2 columns]

In [ ]:
df.MathScore.fillna()